In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
        "Spor":["Kosu","Yuzme","Kosu","Basketbol"],
        "Kalori":[100,200,250,150]}

In [3]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     250
3    Atıl  Basketbol     150

In [5]:
sozluk2={"Isim":["Osman","Levent","Atlas","Fatma"],
        "Spor":["Kosu","Yuzme","Kosu","Basketbol"],
        "Kalori":[200,100,50,300]}

In [7]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

# concatenation

In [9]:
pd.concat([dataFrame1,dataFrame2],axis=0)

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     250
3    Atıl  Basketbol     150
4   Osman       Kosu     200
5  Levent      Yuzme     100
6   Atlas       Kosu      50
7   Fatma  Basketbol     300

# merge

In [16]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep"],
             "Kalori":[100,200,150]}

In [17]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [18]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep"],
             "Spor":["Kosu","Yuzme","Basketbol"]}

In [19]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [20]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on ="Isim")

     Isim  Kalori       Spor
0   Ahmet     100       Kosu
1  Mehmet     200      Yuzme
2  Zeynep     150  Basketbol

In [21]:
maasSozluk= {"Departman": ["Yazilim","Yazilim","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Isim":["Ahmet","Mehmet","Atil","Burak","Miray","Zeynep"],
             "Maas":[100,200,300,400,500,600]}

In [24]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [26]:
maasDataFrame["Departman"].unique() #sadece tekilleri getircek)

array(['Yazilim', 'Pazarlama', 'Hukuk'], dtype=object)

In [27]:
maasDataFrame["Departman"].nunique()

3

In [29]:
maasDataFrame["Departman"].value_counts()

Yazilim      2
Pazarlama    2
Hukuk        2
Name: Departman, dtype: int64

In [34]:
def bruttenNete(maas):
    return maas *0.66

In [36]:
maasDataFrame["Maas"].apply(bruttenNete)

0     66.0
1    132.0
2    198.0
3    264.0
4    330.0
5    396.0
Name: Maas, dtype: float64

In [37]:
maasDataFrame.isnull() # Nan değerler var mı ?

   Departman   Isim   Maas
0      False  False  False
1      False  False  False
2      False  False  False
3      False  False  False
4      False  False  False
5      False  False  False

# pivot table

In [42]:
yeniVeri={"Karakter Sinifi":["South Park","South Park","Simpson","Simpson","Simpson"],
         "Karakter Ismi": ["Cartman","Kenny","Homer","Bart","Bart"],
         "Karakter Yas":[9,10,50,20,60]}

In [43]:
karakterDF=pd.DataFrame(yeniVeri)

In [44]:
karakterDF

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            60

In [46]:
karakterDF.pivot_table(values="Karakter Yas", index=["Karakter Sinifi","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     80
                Homer                    50
South Park      Cartman                   9
                Kenny                    10